{
    "nav": {
        "key": "root",
        "title": "Home",
        "excerpt": "Home",
        "link": "/",
        "date": "2022-12-16T00:00:00",
        "links": [
            {
                "key": "resume",
                "title": "Résumé",
                "excerpt": "",
                "link": "/page/resume-of-paul-m-parks",
                "date": "2022-12-06T13:58:00",
                "links": []
            },
            {
                "key": "applications",
                "title": "Applications",
                "excerpt": "Here are some client-based applications I’ve written. Note that not all of these links work yet; I'm still porting the content to the new site.",
                "link": "/nav/applications",
                "links": [
                    {
                        "key": "pbrain",
                        "title": "Pbrain",
                        "excerpt": "The pbrain programming language is an extension I made to the Brainf**k programming language that adds the ability to define and call procedures.",
                        "link": "/page/pbrain",
                        "date": "2015-06-02T01:14:28",
                        "links": []
                    },
                    {
                        "key": "windragsens",
                        "title": "WinDragsens",
                        "excerpt": "In response to a comment regarding the console-based version of the drag sensitivity utility, I’ve created a new version of the utility that includes a graphical interface and a means of testing the drag settings in the interface.",
                        "link": "/page/windragsens",
                        "date": "2015-05-29T17:36:28",
                        "links": []
                    },
                    {
                        "key": "dragsens",
                        "title": "Dragsens",
                        "excerpt": "Inspired by an article by Raymond Chen about how to correctly change the Windows mouse drag sensitivity, I wrote a simple utility called dragsens. It’s a small command-line utility that will allow you to change the number of pixels the mouse has to travel before a drag operation is initiated.",
                        "link": "/page/dragsens",
                        "date": "2015-05-29T17:30:58",
                        "links": []
                    }
                ]
            },
            {
                "key": "webapps",
                "title": "Web Apps",
                "excerpt": "Here are some web-based applications I've written.",
                "link": "/nav/webapps",
                "date": "2022-12-13T15:00:00",
                "links": [
                    {
                        "key": "conways-game-of-life",
                        "title": "Conway's Game of Life",
                        "excerpt": "I realized one day that I had never implemented Conway’s Game of Life, which is something of a rite of passage for young computer-science students. As I opted for a more non-traditional path to the software profession, I somehow missed that fun, even though I’ve made a point of implementing other computer-sciency things like it.",
                        "link": "/page/conways-game-of-life",
                        "date": "2015-11-20T15:05:09",
                        "links": []
                    },
                    {
                        "key": "barcode-generator",
                        "title": "Barcode Generator",
                        "excerpt": "A simple barcode generator which is badly in need of an update.",
                        "link": "/content/ean13.html?code=0724171484086&desc=Jammie%20Dodgers",
                        "date": "2010-05-06T03:25:00",
                        "links": []
                    }
                ]
            },
            {
                "key": "about",
                "title": "About",
                "excerpt": "About this site and its author.",
                "link": "/about",
                "date": "2022-12-13T15:00:00",
                "links": []
            },
            {
                "key": "contact",
                "title": "Contact",
                "excerpt": "How to contact me.",
                "link": "/contact",
                "date": "2022-12-13T15:00:00",
                "links": []
            }
        ]
    },
    "posts": [
        {
            "key": "new-website-design",
            "title": "New Website Design",
            "excerpt": "I'm in the process of porting my site to ASP.NET Razor Pages using .NET 7.0, hosted on Azure.",
            "link": "/page/new-website-design",
            "date": "2022-12-01T03:57:03"
        },
        {
            "key": "fizzbuzz",
            "title": "FizzBuzz",
            "excerpt": "This is just one of those things you have to write, apparently. Here is mine, in C++.",
            "link": "/page/fizzbuzz",
            "date": "2022-12-01T03:57:03"
        },
        {
            "key": "set-associative-cache-in-c-part-2-interface-design",
            "title": "Set-Associative Cache in C#, Part 2: Interface Design",
            "excerpt": "This is part 2 of a multi-part series on implementing a set-associative cache in C#.",
            "link": "/page/set-associative-cache-in-c-part-2-interface-design",
            "date": "2021-08-04T12:06:15"
        },
        {
            "key": "set-associative-cache-in-c-part-1-analysis-initial-design",
            "title": "Set-Associative Cache in C#, Part 1: Analysis & Initial Design",
            "excerpt": "This is part 1 of a multi-part series in which I turn a coding test from an interview into a more appropriate treatment for the true complexity of the exercise.",
            "link": "/page/set-associative-cache-in-c-part-1-analysis-initial-design",
            "date": "2021-08-01T09:16:05"
        },
        {
            "key": "barbecue-and-project-management",
            "title": "Barbecue and Project Management",
            "excerpt": "Going through the process of preparing some smoked barbecue for Memorial Day got me thinking about a few parallels with project management, particularly in the field of software development.",
            "link": "/page/barbecue-and-project-management",
            "date": "2016-06-10T21:10:16"
        },
        {
            "key": "scheduling-every-minute-revisited",
            "title": "Scheduling Every Minute, Revisited",
            "excerpt": "Late last year, I published an article entitled \"How I Plan Every Minute of My Day to Stay Productive,\" where I described my personal daily workflow of planning the tasks that I need to accomplish and then adjusting that plan as necessary throughout the day. I have a new job now, so I want to post an update on how well the approach is working in a new environment with new responsibilities, and how I've made a few tweaks to the process.",
            "link": "/page/scheduling-every-minute-revisited",
            "date": "2016-02-08T16:08:20"
        },
        {
            "key": "on-recruiting",
            "title": "On Recruiting",
            "excerpt": "I’ll have more to say about this later, but I want to get this quote out there now so that technical leads, engineering managers, engineering directors, and vice-presidents of software engineering can have it embroidered on a pillow, printed on a t-shirt, and taped to their bathroom mirror.",
            "link": "/page/on-recruiting",
            "date": "2016-02-05T01:38:38"
        },
        {
            "key": "how-i-plan-my-day",
            "title": "How I Plan Every Minute of My Day to Stay Productive",
            "excerpt": "Over the years, I have progressed from being a software developer who focuses on code all day, to a designer who designs and codes, to a technical lead who communicates a design and technical strategy to a team of developers, to a technical and project lead who leads developers in the implementation of a project while communicating with customers and other stakeholders. At each level the demands on my time have increased, while the expectations of improved productivity and reliable delivery have also increased.",
            "link": "/page/how-i-plan-my-day",
            "date": "2015-09-09T06:48:58"
        },
        {
            "key": "master-foo-and-the-technical-recruiter",
            "title": "Master Foo and the Technical Recruiter",
            "excerpt": "I found Eric Raymond’s Unix Koans of Master Foo several years ago and simply loved them. Like the Zen koans they are taken from, they are a succinct way to communicate concepts of software development, specifically as they relate to the Unix development subculture.",
            "link": "/page/master-foo-and-the-technical-recruiter",
            "date": "2015-05-28T19:19:12"
        }
    ]
}
